In [2]:
#in 8-11-2020

import pandas as pd
import numpy as np

my_product = [
    
    ('saeed' , 'cooder' , 'saudi arabia' , 50000),
    ('mohamed' , 'frontend', 'egypt' , 140000),
    ('mohab' , 'backend' , 'tunis'  , 110000),
    ('sara' , 'design' , 'algeria' , 90000),
    ('mahmoud' , 'coders', 'sudan' , 60000),
    ('hind' , 'backend' , 'maly' , 70000),
    ('yara' , 'software' , 'dubai', 110000),
    ('mohab' , 'applications', 'kuwait', 100000),
    ('nawaf' , 'backend' , 'saudi', 100000),
    ('mahmoud' , 'fronend' , 'egypt' , 50000)]

data = pd.DataFrame( my_product , columns=['name' , 'job' , 'country' , 'salary'])


data.head()

      name       job       country  salary
0    saeed    cooder  saudi arabia   50000
1  mohamed  frontend         egypt  140000
2    mohab   backend         tunis  110000
3     sara    design       algeria   90000
4  mahmoud    coders         sudan   60000

In [3]:
data.count()

name       10
job        10
country    10
salary     10
dtype: int64

In [4]:
len(data)

10

In [5]:
data.sum()

name       saeedmohamedmohabsaramahmoudhindyaramohabnawaf...
job        cooderfrontendbackenddesigncodersbackendsoftwa...
country    saudi arabiaegypttunisalgeriasudanmalydubaikuw...
salary                                                880000
dtype: object

In [6]:
data.mean()

salary    88000.0
dtype: float64

In [7]:
data.std()

salary    29739.610698
dtype: float64

In [9]:
data.min()

name               hind
job        applications
country         algeria
salary            50000
dtype: object

In [10]:
data.max()

name           yara
job        software
country       tunis
salary       140000
dtype: object

In [19]:
data.median()

salary    95000.0
dtype: float64

In [21]:
data.mode()

      name      job country  salary
0  mahmoud  backend   egypt   50000
1    mohab      NaN     NaN  100000
2      NaN      NaN     NaN  110000

In [22]:
data.describe()

              salary
count      10.000000
mean    88000.000000
std     29739.610698
min     50000.000000
25%     62500.000000
50%     95000.000000
75%    107500.000000
max    140000.000000

In [27]:
data.value_counts()

name     job           country       salary
yara     software      dubai         110000    1
sara     design        algeria       90000     1
saeed    cooder        saudi arabia  50000     1
nawaf    backend       saudi         100000    1
mohamed  frontend      egypt         140000    1
mohab    backend       tunis         110000    1
         applications  kuwait        100000    1
mahmoud  fronend       egypt         50000     1
         coders        sudan         60000     1
hind     backend       maly          70000     1
dtype: int64

In [28]:
data['salary'].value_counts()

110000    2
100000    2
50000     2
70000     1
140000    1
60000     1
90000     1
Name: salary, dtype: int64